>>> server -> client: 10, 20
>>> Cycle()
>> 01 03 00 14 00 06 85 CC
Modbus ErrorCallback: <modbus:1:holding: 20>: no error
Modbus Callback: <modbus:1:holding: 20> becomes 11141307
Modbus ErrorCallback: <modbus:1:holding: 24>: no error
Modbus Callback: <modbus:1:holding: 24> becomes 0
<< 01 03 0C 00 AA 00 BB 00 00 00 00 00 00 00 00 F6 5D
>> 01 04 00 1E 00 02 11 CD
Modbus ErrorCallback: <modbus:1:input: 30>: no error
Modbus Callback: <modbus:1:input: 30> becomes -1
<< 01 04 04 FF FF FF FF FA 10
>>> client -> server: 10
>>> Cycle()
>> 01 10 00 14 00 02 04 00 00 00 0A 73 57
<< 01 10 00 14 00 02 01 CC
>> 01 03 00 14 00 06 85 CC
<< 01 03 0C 00 00 00 0A 00 00 00 00 00 00 00 00 ED D0
>> 01 04 00 1E 00 02 11 CD
<< 01 04 04 FF FF FF FF FA 10
>>> client -> server: -2
>>> Cycle()
>> 01 10 00 14 00 02 04 FF FF FF FE 33 04
<< 01 10 00 14 00 02 01 CC
>> 01 03 00 14 00 06 85 CC
<< 01 03 0C FF FF FF FE 00 00 00 00 00 00 00 00 8A E5
>> 01 04 00 1E 00 02 11 CD
>>> client -> server: -0.123 (scaled)
>>> Cycle()
<< 01 04 04 FF FF FF FF FA 10
>> 01 10 00 18 00 02 04 FF FF FF 85 73 72
<< 01 10 00 18 00 02 C1 CF
>> 01 03 00 14 00 06 85 CC
<< 01 03 0C FF FF FF FE 00 00 00 00 FF FF FF 85 0A 92
>> 01 04 00 1E 00 02 11 CD
>>> server -> client: 0xffff 0xff85 (scaled)
>>> Cycle()
<< 01 04 04 FF FF FF FF FA 10
>> 01 03 00 14 00 06 85 CC
<< 01 03 0C FF FF FF FE 00 00 00 00 FF FF FF 85 0A 92
>> 01 04 00 1E 00 02 11 CD
<< 01 04 04 FF FF FF FF FA 10
(pty-based fake serial -- stopping forwarding)
